Repository: AhmedEmad108/shopak
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: Online Shop
ar: متجر اونلاين

source: Hello!...
ar: مرحبا!...

# shopak
source: Shopak at Your Convenience 🤪
ar: شوبك علي كيفك 🤪

source: Next
ar: التالي

source: Skip
ar: تخطي

source: Start Now
ar: ابدأ الان

# terms_and_conditions
source: Terms & Conditions
ar: الشروط والأحكام

source: Welcome to Our Application!
ar: مرحبا بك في تطبيقنا!

# terms
source: These terms and conditions outline the rules and regulations for the use of our app. By accessing this app, we assume you accept these terms and conditions. Do not continue to use the app if you do not agree to all of the terms and conditions stated on this page. - Usage: The app is intended for personal use only. - Privacy: We are committed to protecting your privacy. Your data will be handled according to our privacy policy. - Liability: We are not liable for any damages arising from the use of this app. - Changes: We reserve the right to modify or update these terms and conditions at any time. - Termination: We may terminate this app at any time without notice. Thank you for using our app!
ar: تحدد هذه الشروط والأحكام القواعد والضوابط الخاصة باستخدام تطبيقنا. بدخولك إلى هذا التطبيق، نعتبر أنك توافق على هذه الشروط والأحكام. إذا لم توافق على جميع الشروط والأحكام المذكورة في هذه الصفحة، يرجى عدم الاستمرار في استخدام التطبيق. - الاستخدام: التطبيق مخصص للاستخدام الشخصي فقط. - الخصوصية: نحن ملتزمون بحماية خصوصيتك. سيتم التعامل مع بياناتك وفقًا لسياسة الخصوصية الخاصة بنا. - المسؤولية: نحن غير مسؤولين عن أي أضرار تنتج عن استخدام هذا التطبيق. - التعديلات: نحتفظ بحق تعديل أو تحديث هذه الشروط والأحكام في أي وقت. - الإيقاف: يجوز لنا إيقاف التطبيق في أي وقت دون إشعار مسبق. شكرًا لاستخدامك تطبيقنا!

source: Agree & Continue
ar: موافق ومتابعة

source: Welcome To Shopak
ar: مرحبا بك في شوبك

# start_shopping
source: Start Your Shopping Journey With Shopak
ar: ابدأ رحلة التسوق الخاصة بك مع شوبك

# from_electronics_to_fashion
source: From Electronics And Fashion To Home Goods and Gifts - Everything You Need, In One Place.
ar: من الالكترونيات والموضة لمنتجات البيت والهدايا - كل اللي نفسك فيه هتلاقيه في مكان واحد.

# browse_shop
source: Browse & Shop Freely
ar: أبحث وأشتري براحتك

# explore_products
source: Explore Products With Ease, Check Photos, Reviews, and Compare Prices.
ar: استعرض كل المنتجات بسهولة.

# pick_suits
source: Pick What Suits You And Order In Seconds.
ar: شوف الصور والتقييمات، وقارن الأسعار، واختر اللي يناسبك واطلب في ثواني.

# order_delivered
source: Order... Delivered To Your Door
ar: أطلب... وهيجيلك لحد بابك

# order_quickly
source: Your Orders Reach You Quickly And Safely - Wherever You Are.
ar: طلباتك هتوصلك بسرعة وأمان لأي مكان.

# with_shopak
source: With Shopak, Shopping Is Easier Than Ever.
ar: مع شوبك، التسوق بقا أسهل وأسرع.

source: Sign In
ar: تسجيل الدخول

source: Sign Up
ar: تسجيل

# name
source: User Name
ar: الاسم

# enter_name
source: Enter Your User Name
ar: ادخل اسمك

source: Email
ar: البريد الالكتروني

# enter_email
source: Enter Your Email
ar: ادخل بريدك الالكتروني

source: Phone
ar: رقم الهاتف

# enter_phone
source: Enter Your Phone
ar: ادخل رقم هاتفك

source: Address
ar: العنوان

# enter_address
source: Enter Your Address
ar: ادخل عنوانك

source: Country
ar: الدولة

source: City
ar: المدينة

# select_city
source: Select Your City
ar: اختر مدينتك

# select_country
source: Select Your Country
ar: اختر دولتك

# select_country_first
source: Please Select Your Country First
ar: يرجى اختيار دولتك اولا

source: Password
ar: كلمة المرور

source: Your Password
ar: كلمة المرور

source: Enter Your Password
ar: ادخل كلمة المرور

source: Enter
ar: ادخل

source: Confirm Password
ar: تأكيد كلمة المرور

source: Enter Confirm Your Password
ar: ادخل تأكيد كلمة المرور

source: Current
ar: الحالي

source: New
ar: جديد

source: Confirm New
ar: تأكيد جديد

# terms_and_condition1
source: By signing up, you agree to
ar: بالتسجيل فإنك توافق على

# terms_and_condition2
source: Terms & Conditions
ar: شروط الخدمة وسياسة الخصوصية.

source: Already have an account?
ar: لديك حساب؟

source: Forget Password?
ar: نسيت كلمة المرور؟

# do_not_have_an_account
source: Don’t have an account?
ar: ليس لديك حساب؟

# sign_with_google
source: Sign in with Google
ar: تسجيل الدخول بواسطة جوجل

# sign_with_facebook
source: Sign in with Facebook
ar: تسجيل الدخول بواسطة فيسبوك

source: Welcome back!...
ar: مرحبا بعودتك!...

# or
source: OR SIGN IN WITH
ar: او تسجيل الدخول بواسطة

source: Sign Up
ar: تسجيل

source: Successfully created account
ar: تم انشاء الحساب بنجاح

source: Please Verify Your Email
ar: الرجاء تفعيل بريدك الالكتروني

source: or continue with
ar: أو

source: Please accept terms and conditions
ar: الرجاء قبول شروط الخدمة وسياسة الخصوصية

source: Password and confirm password not match
ar: كلمة المرور وتأكيد كلمة المرور لا تتطابق

source: Create Account
ar: انشاء حساب

source: Login to continue
ar: تسجيل الدخول للمتابعة

source: Create Account to continue
ar: انشاء حساب للمتابعة

# create_account_to_continue_description
source: Create Account to continue and enjoy our services
ar: انشاء حساب للمتابعة وتتمكن من تسجيل الدخول بخطوة واحدة

source: Home
ar: الصفحة الرئيسية

source: Products
ar: المنتجات

source: Profile
ar: الملف الشخصي

source: Shopping Cart
ar: عربة التسوق

source: Orders
ar: الطلبات

# gg
source: Orders
ar: الطلبات

source: Edit Profile
ar: تعديل الملف الشخصي

source: Change Email
ar: تغيير البريد الالكتروني

# edit_email_message
source: Are you sure you want to change your email?
ar: هل انت متاكد من تغيير البريد الالكتروني؟

source: Change Password
ar: تغيير كلمة المرور

# become_seller
source: Become A Seller
ar: اصبح بائع

source: Change Theme
ar: تغيير التصميم

source: Change Language
ar: تغيير اللغة

source: Logout
ar: تسجيل الخروج

source: Dark Mode
ar: الوضع الداكن

source: Light Mode
ar: الوضع الفاتح

source: English
ar: اللغة الانجليزية

source: Arabic
ar: اللغة العربية

source: Save
ar: حفظ

source: Cancel
ar: الغاء

source: See All
ar: اظهار الكل

source: Best Selling
ar: الاكثر مبيعاً

source: LE
ar: جنيه مصري

source: Search
ar: بحث

source: Search For Products
ar: ابحث عن منتجاتك

source: Shop Now
ar: تسوق الان

source: Check Your Email
ar: تحقق من بريدك الالكتروني

# please_enter_your_email
source: Please Enter Your Email Addresss To Recieve A Verification Code
ar: الرجاء ادخال بريدك الالكتروني لتلقي رمز التحقق

source: Verification Code
ar: رمز التحقق

source: Check Code
ar: تحقق من رمزك

# please_enter_your_verification_code
source: Please Enter Your Digit Code Sent To
ar: الرجاء ادخال رمز التحقق الذي تم ارساله ل

source: Verify Code
ar: تحقق من رمزك

# didnot_receive_code
source: Didn’t Receive Code?
ar: لم تستلم رمز؟

source: Resend Code
ar: ارسال مرة اخرى

source: Reset Password
ar: اعادة تعيين كلمة المرور

source: Create New Password
ar: انشاء كلمة مرور جديدة

# your_new_password
source: Your new password must be different from previous used passwords.
ar: كلمة المرور الجديدة يجب ان تختلف عن كلمة المرور السابقة.

source: Congratulations!
ar: تهانينا!

# your_password_has_been_changed
source: Your Password Has Been Changed Successfully
ar: تم تغيير كلمة المرور الخاصة بك

# go_to_login
source: Go To Sign In
ar: الذهاب لتسجيل الدخول بنجاح

source: Not Valid Email
ar: البريد الالكتروني غير صالح

source: Not Valid Name
ar: الاسم غير صالح

source: Not Valid Phone
ar: رقم الهاتف غير صالح

source: Not Valid Price
ar: السعر غير صالح

source: Not Valid Address
ar: العنوان غير صالح

source: Cant Be Empty
ar: لا يمكن ترك هذا الحقل فارغاً

source: Cant Be Large Than
ar: لا يمكن ترك هذا الحقل اكبر من

source: Cant Be Less Than
ar: لا يمكن ترك هذا الحقل اقل من

source: Dashboard
ar: لوحة التحكم

# add_category
source: Add Categery
ar: اضافة فئة

# category
source: Categories
ar: الفئات

source: Add Product
ar: اضافة منتج

# product_name_ar
source: Product Name Arabic
ar: اسم المنتج بالعربي

# enter_product_name_ar
source: Enter Product Name Arabic
ar: ادخل اسم المنتج بالعربي

# product_name_en
source: Product Name English
ar: اسم المنتج بالانجليزي

# enter_product_name_en
source: Enter Product Name English
ar: ادخل اسم المنتج بالانجليزي

# product_description_ar
source: Product Description Arabic
ar: وصف المنتج بالعربي

# enter_product_description_ar
source: Enter Product Description Arabic
ar: ادخل وصف المنتج بالعربي

# product_description_en
source: Product Description English
ar: وصف المنتج بالانجليزي

# enter_product_description_en
source: Enter Product Description English
ar: ادخل وصف المنتج بالانجليزي

source: Product Price
ar: سعر المنتج

source: Enter Product Price
ar: ادخل سعر المنتج

source: Product Code
ar: كود المنتج

source: Enter Product Code
ar: ادخل كود المنتج

# product_category_ar
source: Product Category Arabic
ar: فئة المنتج بالعربي

# enter_product_category_ar
source: Enter Product Category Arabic
ar: ادخل فئة المنتج بالعربي

# product_category_en
source: Product Category English
ar: فئة المنتج بالانجليزي

# enter_product_category_en
source: Enter Product Category English
ar: ادخل فئة المنتج بالانجليزي

source: Product Image
ar: صورة المنتج

source: Is Featured Item
ar: هل هو منتج مميز

source: Add
ar: اضافة

source: Update
ar: تحديث

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Delete Category
ar: حذف الفئة

source: Delete Product
ar: حذف المنتج

source: Edit Category
ar: تعديل الفئة

source: Edit Product
ar: تعديل المنتج

source: No Products Found
ar: لا يوجد منتجات

source: No Categories Found
ar: لا يوجد فئات

source: Settings
ar: الاعدادات

# please_select_image
source: Please Select An Image
ar: الرجاء تحديد صورة

# confirm_delete_message_product
source: Are You Sure You Want To Delete This Product?
ar: هل تريد حذف هذا المنتج؟

# confirm_delete_message_category
source: Are You Sure You Want To Delete This Category?
ar: هل تريد حذف هذه الفئة؟

# confirm_delete_title
source: Confirm Delete
ar: تأكيد الحذف

source: No Data
ar: لا يوجد بيانات

# categoryExists
source: This Category Already Exists
ar: هذه الفئة موجود بالفعل

source: Product Edited Successfully
ar: تم تعديل المنتج بنجاح

source: Product Added Successfully
ar: تم اضافة المنتج بنجاح

source: Category Edited Successfully
ar: تم تعديل الفئة بنجاح

source: Category Added Successfully
ar: تم اضافة الفئة بنجاح

source: Category Deleted Successfully
ar: تم حذف الفئة بنجاح

source: Product Deleted Successfully
ar: تم حذف المنتج بنجاح

source: Active Categories
ar: الفئات النشطة

source: Inactive Categories
ar: الفئات غير النشطة

source: Search categories...
ar: بحث عن فئة...

source: All Categories
ar: كل الفئات

# empty_search_results
source: No search results
ar: لا توجد نتائج للبحث

source: Retry
ar: إعادة المحاولة

source: Refresh
ar: تحديث

source: Confirm
ar: تأكيد

source: Ok
ar: حسنا

# pull_to_refresh
source: Pull down to refresh
ar: اسحب لأسفل للتحديث

source: All Products
ar: كل المنتجات

source: Active Products
ar: المنتجات النشطة

source: Inactive Products
ar: المنتجات غير النشطة

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Image updated successfully
ar: تم تحديث الصورة بنجاح

# invalid_username
source: Please enter a valid username
ar: الرجاء إدخال اسم مستخدم صحيح

# invalid_email
source: Please enter a valid email address
ar: الرجاء إدخال بريد إلكتروني صحيح

# invalid_phone
source: Please enter a valid phone number
ar: الرجاء إدخال رقم هاتف صحيح

source: Confirm Save
ar: تأكيد الحفظ

# save_changes_message
source: Are you sure you want to save these changes?
ar: هل أنت متأكد من حفظ هذه التغييرات؟

source: Inactive
ar: غير نشط

source: Active
ar: نشط

# product
source: Products
ar: منتج

source: Profile edited successfully
ar: تم تعديل الملف الشخصي بنجاح

source: Current Password
ar: كلمة المرور الحالية

source: Enter Current Password
ar: ادخل كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Enter New Password
ar: ادخل كلمة المرور الجديدة

source: Confirm New Password
ar: تاكيد كلمة المرور الجديدة

source: Enter Confirm New Password
ar: ادخل تاكيد كلمة المرور الجديدة

source: Password updated failed
ar: فشل تحديث كلمة المرور

source: Invalid current password
ar: كلمة المرور الحالية غير صالحة

source: New password and confirm password does not match
ar: كلمة المرور الجديدة وتاكيد كلمة المرور غير متطابقان

source: Password updated successfully
ar: تم تحديث كلمة المرور بنجاح

# logout_message
source: Are you sure you want to logout?
ar: هل تريد تسجيل الخروج؟

# name_vendor_en
source: Name Vendor in English
ar: اسم البائع بالانجليزي

# name_vendor_ar
source: Name Vendor in Arabic
ar: اسم البائع بالعربي

# enter_name_vendor_en
source: Enter the name of the vendor in English
ar: ادخل اسم البائع بالانجليزي

# enter_name_vendor_ar
source: Enter the name of the vendor in Arabic
ar: ادخل اسم البائع بالعربي

source: Phone Vendor
ar: رقم الهاتف للبائع

source: Vendor Address
ar: عنوان البائع

# enter_vendor_address
source: Enter the address of the vendor
ar: ادخل عنوان البائع

# enter_phone_vendor
source: Enter the phone number of the vendor
ar: ادخل رقم الهاتف للبائع

# vendor_message
source: To become a seller, you need to fill out the form below. We will review your request and get back to you as soon as possible.
ar: لتصبح بائعا، يجب تعبئة النموذج التالي. سيتم مراجعة طلبك والحصول على ردك في اسرع وقت ممكن.

# vendor_message2
source: Please fill out the form below to become a seller. We will review your request and get back to you as soon as possible.
ar: يرجى تعبئة النموذج التالي لتصبح بائعا. سيتم مراجعة طلبك والحصول على ردك في اسرع وقت ممكن.
